#15 Что больше : сумма элементов последовательности с четными значениями, или с нечетными ?
a=[]
x=int(input('Введите размер массива: '))
for i in range(x):
    a.append(int(input('Заволните массив: ')))

#36 Максимальное значение|a[i]-a[i+1]|в последовательности (максимальный перепад значений).

#13. Пусть в массиве последовательно записаны цифры некоторого длинного десятичного числа.
#Реализовать функции "прибавляющие единицу"и "вычитающие единицу"из такого числа.

#1. Симметричны ли значения элементов массива?

#1) Дан массив a[1..n] типа integer.Упорядочить элементы массива а
#по возрастанию в соответствии со следующим критерием : элемент x считается
#"больше" элемента y, если первая цифра числа x больше первой цифры y.

#2) Дана действительная матрица размером MxN.Пусть для каждой строки
#матрицы определена функция f(a), равная сумме нечетных элементов строки a.
#Упорядочить(переставить) строки матрицы по неубыванию в соответствии
#со следующим критерием : строка a считается "больше" строки b, если f(a) > f(b).

#3) Пусть для целого n>0 функция d(n) равна количеству делителей числа n.
#Дано m>0. Упорядочить все числа n от 1 до m в порядке возрастания значений d(n).
#Указание: использовать только один массив длиной m.